Revit 2027 API
Connector.GasketLength Property
 Connector gasket length. When applicable, it represents the distance from the end of the fabrication part to the center of the gasket. Otherwise it returns zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GasketLength { get; }
Public ReadOnly Property GasketLength As Double
	Get
public:
property double GasketLength {
	double get ();
}
member GasketLength : float with get
Property Value
Double
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace